<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class AboutTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('abouts')->insert([

            [
                'title' => 'نبذة عنا',
                'content' => '
                مرحبًا بكم في "دليلك"، الموقع الرائد الذي يجمع بين الابتكار والشفافية لتقديم حلول عقارية متكاملة، سواء كنت باحثًا عن عقار جديد، أو ترغب في بيع أو تأجير ممتلكاتك. "دليلك" هو بوابتك للوصول إلى أفضل الفرص العقارية في السوق.
نحن نفهم أن العقارات تمثل جزءًا مهمًا من حياة الأفراد والشركات، ولذلك نسعى لتوفير تجربة سهلة وآمنة وموثوقة لكل مستخدمينا. مع "دليلك"، لن تضطر للبحث بعيدًا للحصول على العقار المثالي.

                ',
            ],

            [
                'title' => 'أهدافنا في دليلك:',
                'content' => '
                 نحن في "دليلك" نضع لأنفسنا أهدافًا واضحة تهدف إلى تقديم قيمة حقيقية لكل مستخدمينا:
- توفير موقع شامل: نعمل على بناء موقع واحد شامل يربط بين المشتري والبائع والمستأجر والمزود، لتلبية جميع احتياجاتهم العقارية في مكان واحد.
- تعزيز الشفافية: نحرص على تقديم معلومات دقيقة وموثوقة عن كل العقارات، لتمكين المستخدمين من اتخاذ قرارات مستنيرة وثقة تامة في التعاملات.
- تسهيل الوصول: نسعى لتوفير أدوات بحث متطورة وسهلة الاستخدام تمكن المستخدمين من الوصول السريع إلى العقارات التي تناسب احتياجاتهم بدقة وسرعة.
- دعم نمو السوق العقاري: من خلال تقديم خدمات مبتكرة، نساعد على تعزيز السوق العقاري وجعله أكثر كفاءة ومرونة، مما يساهم في تنمية هذا القطاع الحيوي.
                ',

            ],
            [
                'title' => ' رؤيتنا في دليلك: ',
                'content' => '

                  "دليلك" يسعى ليصبح الوجهة الأولى لكل من يبحث عن فرص عقارية في المجتمع اليمني. نحن نطمح لأن نكون المرجع الأول للمشترين، المستثمرين، والمزودين، حيث نعتمد على أحدث التقنيات والأساليب لتحقيق تجربة استخدام متكاملة تُسهل على الجميع الوصول إلى العقارات التي يرغبون فيها.
                  خدمات الموقع:
                  "دليلك" يقدم مجموعة واسعة من الخدمات العقارية التي تغطي جميع جوانب السوق العقاري، من البيع والشراء إلى التأجير، بهدف تلبية احتياجات جميع المستخدمين:
                   •	البحث المتقدم عن العقارات: نوفر أدوات بحث متقدمة تسهل عملية العثور على العقار المثالي سواء كان ذلك للشراء أو الإيجار، مع القدرة على التصفية بناءً على الموقع، النوع، السعر، والمواصفات.
•	نشر الإعلانات العقارية: نقدم لأصحاب العقارات فرصة نشر إعلاناتهم بشكل سهل وفعال، مع إمكانية إضافة تفاصيل كاملة عن العقار، بما في ذلك الصور والفيديوهات لتوفير تجربة تفاعلية وشاملة للمشترين المحتملين.
•	التواصل المباشر بين الأطراف: نسهل عملية التواصل بين المشترين والمستأجرين من جهة، والملاك والمزودين من جهة أخرى، لتسهيل إتمام الصفقات بسرعة وأمان.
•	خدمات التقييم العقاري: نقدم أدوات وخبرات لتقييم العقارات بدقة بناءً على معايير السوق المحلية، مما يساعد المستخدمين في تحديد القيمة الحقيقية للعقارات التي يهتمون بها.
•	إدارة العقارات: نقدم حلولًا لإدارة العقارات من خلال مزودين معتمدين لضمان أعلى مستوى من الخدمة والراحة لعملائنا.


                ',

            ],
            [
                'title' => ' قيمنا في دليلك:',
                'content' => '


نحن نؤمن بأن العمل وفق قيم راسخة هو ما يميز "دليلك" ويعزز ثقة المستخدمين في خدماتنا. هذه القيم تعكس رؤيتنا وتوجهاتنا في تقديم خدمات عقارية استثنائية:
 الابتكار:
نؤمن أن الابتكار هو ما يدفعنا للتقدم. نحن نبحث دائمًا عن استخدام أحدث التقنيات العقارية لتقديم تجربة استخدام غير مسبوقة، سواء من خلال تحسين طرق البحث، أو توفير أدوات تقييم تفاعلية، أو تسهيل التواصل بين الأطراف.
 رضا العملاء:
عملاؤنا هم جوهر عملنا. نعمل دائمًا على تحقيق أعلى مستويات الرضا من خلال توفير خدمات مصممة خصيصًا لتلبية احتياجاتهم. نقدم دعمًا فنيًا ممتازًا واستجابة سريعة لأي استفسارات أو مشكلات، ونحرص على أن تكون تجربة العميل معنا سلسة وخالية من العوائق.
الالتزام والمصداقية:
نحن ملتزمون بتقديم خدمات عالية الجودة مع الحفاظ على المصداقية في كل ما نقدمه. نبني علاقتنا مع عملائنا على الثقة المتبادلة، ونعمل باستمرار على تحسين تجربتهم من خلال تقديم معلومات دقيقة وموثوقة. نحن نؤمن بأن الشفافية والمصداقية هما أساس أي علاقة ناجحة في السوق العقاري.





                ',

            ],
            [
                'title' => 'لماذا تختار دليلك؟',
                'content' => '
                   في "دليلك"، نضمن لك تجربة عقارية متكاملة تجمع بين التكنولوجيا المتطورة والخدمات الشخصية لتلبية احتياجاتك العقارية. نحن هنا لنكون شريكك الموثوق في كل خطوة، سواء كنت تبحث عن منزل جديد، أو ترغب في بيع عقار، أو حتى تبحث عن فرصة استثمارية في السوق العقاري.
"دليلك" هو دليل عقارك الأمثل.



                ',

            ],




        ]);
    }
}
