<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class ConditionsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('conditions')->insert([
            [
                'header' => 'شروط الاستخدام ',
                'content' => 'مرحبًا بك في موقع "دليلك"، العقاري الرائد الذي يجمع بين العملاء والمزودين من شركات، مكاتب، ووكلاء لتسهيل عملية البحث عن العقارات وتقديم الخدمات العقارية بكل سهولة وشفافية.
                 باستخدامك لموقع "دليلك"، فإنك توافق على الالتزام بالشروط والأحكام الموضحة في هذه الوثيقة.
                 نهدف من خلال هذه الشروط إلى تنظيم العلاقة بين الأطراف المختلفة وضمان بيئة آمنة وفعّالة للجميع.
                نرجو منك قراءة هذه الشروط بعناية قبل استخدام الموقع.
                - العميل: هو الشخص أو الجهة التي تدخل إلى الموقع لاستخدام خدماته، مثل البحث عن عقارات، الاطلاع على الإعلانات، أو   التواصل مع المزودين.
                - المزود: قد يكون فردًا، شركة، مكتبًا عقاريًا أو وكيلًا يعرض عقارات أو خدمات عقارية على الموقع.
                - الموقع: المنصة الرقمية التي تقدم خدمات الربط بين العملاء والمزودين.
              "يُشير مصطلح "العميل" إلى أي مستخدم يقوم باستخدام خدمات موقعنا للبحث عن عقارات. بينما يُشير مصطلح "المزود" إلى أي شخص أو كيان يعرض عقارات أو خدمات عقارية عبر الموقع."
               .'
            ],
            [
                'header' => 'من نحن وكيف يمكن التواصل معنا:  ',
                'content' => ' يعد هذا الموقع ملكا لشركة دليلك للتطوير العقاري الشركة النشأة في اليمن وتعمل علي تولي تشغيل الموقع
للتواصل معنا بخصوص شروط الاستخدام هذه أو أي مسائل أخرى ذات صلة باستخدام هذه المنصة، يرجى مراسلتنا عبر البريد الإلكتروني الخاص بفريق الدعم والمساعدة    Support@dalalelk.com
',
            ],

            [
                'header' => 'يعد استخدامك للموقع إقرار منك بقبول شروط الاستخدام هذه:',
                'content' => 'بوصولك إلى الموقع واستمرارك في استخدامها فإنك تقر بقبولك شروط الاستخدام هذه، وتقر وتوافق على أن شروط الاستخدام هذه تحكم وتقيد وصولك إلى الموقع وأي محتوى واستخدامك لهما.
تفهم أن شروط الاستخدام هذه تمثل عقدًا ملزمًا بينك وبين موقع دليلك.
إن لم تكن موافقًا على الالتزام بشروط الاستخدام هذه، فلا يجوز لك الوصول إلى الموقع أو المحتوى أو استخدامهما، ويجب عليك التوقف فورًا عن استخدامهما.
ويحق للموقع تحملك المسؤولية الكاملة في حال مخالفتك للوائح العقارية العامة واللوائح الخاصة بالموقع واحالتك للمسألة القانونية
',
            ],
            [
                'header' => 'حق الموقع في تعديل شروط الاستخدام:',
                'content' => 'يحق لنا  تعديل هذه الشروط من حين الي اخر بما يتناسب مع سير عمل الموقع, علية سيتم ابلاغك من خلال الاشعارات ويحق لنا حظرك في حال لم تتجاوب مع التحديثات التي اجرية.',
            ],
            [
                'header' => 'حق تعليق عمل الموقع او اقافه:',
                'content' => 'لا نضمن استمرارية إتاحة الموقع  أو أي محتوى أو كليهما مجانًا أو إتاحتهما على وجه العموم. يجوز لنا تعليق عمل الموقع بالكامل أو جزء منه أو إيقاف عمله أو تقييد إتاحته لأسباب تجارية أو تشغيلية أو كليهما. ',
            ],
            [
                'header' => 'حقك في استخدام الموقع والمحتوي:',
                'content' => 'يمنحك موقع "دليلك"  حقًا محدودًا وغير حصري لاستخدام الموقع والخدمات المقدمة فيه لأغراض شخصية بحتة، مثل استعراض العقارات، الاطلاع على الإعلانات، والتواصل مع المزودين بشأن العروض والخدمات العقارية المتاحة. يجب أن يتم هذا الاستخدام وفقًا لشروط الاستخدام والقوانين المحلية والدولية ذات الصلة.
جميع المحتويات الموجودة على الموقع، بما في ذلك النصوص، الصور، الرسومات، الفيديوهات، الشعارات، والتصاميم، محمية بموجب حقوق الملكية الفكرية وتعود ملكيتها لموقع "دليلك" أو لأصحاب الحقوق الآخرين (مثل المزودين). يُسمح لك بالوصول إلى هذه المحتويات واستخدامها فقط لأغراض استكشاف العروض أو الحصول على خدمات الموقع، ويُمنع أي استخدام آخر، بما في ذلك النسخ أو التوزيع أو التعديل أو إعادة النشر، دون إذن خطي مسبق من "دليلك" أو صاحب الحقوق.
كما يحتفظ موقع "دليلك" بالحق في تعديل أو إزالة أي محتوى أو خدمات من الموقع في أي وقت ودون إشعار مسبق، ولن يكون الموقع مسؤولًا  اتجاه العملاء عن أي تعديلات أو توقفات عن تقديم هذه الخدمات.
',
            ],
            [
                'header' => 'القيود:',
                'content' => '

•	يحظر استخدام الموقع في أي أنشطة مخالفة للقوانين واللوائح المحلية أو الدولية، بما في ذلك الاحتيال أو تقديم معلومات مضللة.
•	يمنع نسخ أو تعديل أو توزيع أو إعادة نشر أي جزء من الموقع أو محتوياته بدون إذن خطي مسبق من "دليلك" أو صاحب الحقوق، باستثناء ما هو مسموح به قانونيًا.
•	يُمنع استخدام أي تقنيات أو أدوات تؤدي إلى التأثير سلبًا على أداء الموقع أو التدخل في وظائفه، مثل محاولة اختراق الأمان، استخدام الفيروسات أو البرمجيات الخبيثة، أو إرسال رسائل غير مرغوب فيها (spam).
•	يُمنع إنشاء حسابات مزيفة أو انتحال شخصية أشخاص أو كيانات أخرى بهدف الاحتيال أو إرباك المستخدمين الآخرين.
•	يحظر استخدام الموقع لأي أنشطة تجارية غير معتمدة من "دليلك"، بما في ذلك الإعلان أو الترويج لخدمات أو منتجات خارج نطاق الموقع دون الحصول على موافقة مسبقة.
•	يجب على العملاء استخدام وسائل الاتصال المتاحة للتفاعل مع المزودين بشكل مسؤول وبدون إزعاج أو مضايقة أو طلبات غير مشروعة.
•	يُمنع نشر أي محتوى يعتبر غير قانوني أو مسيء أو ينتهك حقوق الآخرين، بما في ذلك التعليقات أو الرسائل التي تحرض على الكراهية، التمييز، أو أي سلوك غير أخلاقي.
•	المستخدم مسؤول عن أنشطته على الموقع، ويتحمل المسؤولية الكاملة عن أي ضرر قد ينجم عن عدم الامتثال لهذه القيود.
 ويحق لنا ابلاغ السلطات المعنية عن  أي مخالفة للقيود المدرجة أعلاه والتعاون مع تلك السلطات بالإفصاح عن هويتك لهم.




                ',
            ],

            [
                'header' => 'انشاء حساب:',
                'content' => '

يتيح موقع "دليلك" نوعين من الحسابات للمستخدمين، كل منهما مخصص لفئة معينة من المستخدمين بهدف تحسين التجربة العقارية على المنصة. عند إنشاء أي حساب، يوافق المستخدم على الالتزام بالشروط والأحكام التالية:
 حساب العميل:
حساب العميل مخصص للأفراد الذين يبحثون عن عقارات للشراء أو الإيجار، ويتيح لهم استعراض العقارات المعروضة على الموقع والتواصل مع المزودين. يجب على العميل الالتزام بالشروط التالية عند إنشاء الحساب:
•	عند انشاء حساب، يجب تقديم معلومات دقيقة وكاملة، مثل الاسم الكامل، البريد الإلكتروني، رقم الهاتف، وكلمة مرور آمنة. يتعهد العميل بتحديث بياناته بانتظام لضمان دقتها.
•	يحق للعميل استخدام الحساب لأغراض شخصية فقط، مثل البحث عن العقارات والتواصل مع المزودين. يُمنع استخدام الحساب لأغراض تجارية أو لأي نشاط غير مصرح به.
•	 يتحمل العميل المسؤولية الكاملة عن جميع الأنشطة التي تتم من خلال حسابه، ويتعهد بعدم مشاركة بيانات تسجيل الدخول مع أي شخص آخر. في حالة وجود نشاط غير مصرح به، يجب إبلاغ إدارة الموقع فورًا.
•	يحتفظ موقع "دليلك" بالحق في إلغاء أو تعليق حساب العميل في حال انتهاك الشروط أو في حال استخدام الحساب بشكل غير قانوني أو غير لائق.
 حساب المزود:
حساب المزود مخصص للشركات، المكاتب العقارية، أو الوكلاء الذين يرغبون في عرض عقاراتهم أو تقديم خدماتهم عبر الموقع. يجب على المزود الالتزام بالشروط التالية عند إنشاء الحساب:
•	يتعين على المزود تقديم معلومات دقيقة ومحدثة عند التسجيل، بما في ذلك الاسم القانوني للشركة أو المكتب، عنوان البريد الإلكتروني، رقم الهاتف، والمعلومات الأخرى ذات الصلة بالخدمات العقارية التي يقدمها. يجب على المزود تقديم الوثائق الرسمية التي تثبت صلاحية نشاطه العقاري.
•	 يُستخدم حساب المزود فقط لغرض عرض العقارات وتقديم الخدمات العقارية ذات الصلة. يُحظر على المزود استخدام الحساب لأي أغراض غير قانونية أو مضللة.
•	 يتحمل المزود المسؤولية الكاملة عن دقة وصحة المعلومات المدرجة حول العقارات، بما في ذلك الوصف، الصور، الأسعار، والموقع. يُمنع نشر معلومات خاطئة أو مضللة.
•	 يحتفظ موقع "دليلك" بالحق في تعليق أو إلغاء حساب المزود في حالة انتهاك الشروط أو تقديم معلومات مغلوطة، أو إذا ثبت تورط المزود في أنشطة احتيالية.



                ',
            ],

            [
                'header' => 'الإعلانات:',
                'content' => '
يتيح موقع "دليلك" نشر الإعلانات العقارية لمجموعة من الفئات، بما في ذلك الشركات، المكاتب العقارية، الملاك، الوكلاء. يجب على كل فئة الالتزام بالشروط المحددة لضمان الشفافية، الدقة، والامتثال للقوانين.

 اذا كنت شركة او مكتب عقاري:
 •	يتعين على كليهما تقديم وثائق رسمية تثبت تسجيلهما القانوني، مثل السجل التجاري وشهادة مزاولة النشاط العقاري.
•	يجب أن تكون جميع الإعلانات المقدمة  دقيقة، بما يشمل تفاصيل العقار مثل الموقع، المواصفات، الأسعار، وأي شروط خاصة. يُمنع نشر معلومات مضللة أو غير صحيحة.
•	يجب  الإفصاح عن أي مشاكل او نزاعات حول الإعلانات .
•	يجب أن تكون جميع العروض والخدمات المعلن عنها واضحة ومفهومة للعملاء، مع توفير وسائل اتصال صحيحة وسهلة للتواصل .
•	يجب الالتزام بجميع القوانين واللوائح العقارية المحلية والدولية ذات الصلة بالإعلانات.
•	يجب تقديم الوثائق الرسمية التي تؤكد أن المكتب مخول لتقديم خدمات الوساطة العقارية بشكل قانوني.
•	إذا كانت الإعلانات تتم بناءً على اتفاق حصري أو شراكة مع طرف ثالث، فيجب توضيح ذلك في الإعلان، ويجب تقديم كافة المعلومات المتعلقة بالعقار بوضوح.
•	يتعين  التعامل مع العملاء بمهارة وحرفية، مع تقديم جميع المعلومات والدعم المطلوب بشكل شفاف ومنظم.

 إذا كنت مالكًا:
 •	يجب على المالك تقديم مستندات تثبت ملكيته للعقار المعروض للإعلان، وأنه يحق له التصرف فيه بشكل قانوني.
•	يجب أن يتضمن الإعلان تفاصيل دقيقة وموثوقة حول العقار، مثل حالته، موقعه، مواصفاته، والسعر المقترح. لا يجوز نشر معلومات خاطئة أو مبالغ فيها.
•	يتحمل المالك المسؤولية الكاملة عن محتوى الإعلان وصحته، وعن أي ادعاءات أو تفاصيل غير صحيحة.
 اذا كنت وكيلاً:
 •	يجب على الوكيل تقديم مستند رسمي يثبت أنه مخول للتصرف نيابةً عن المالك أو المكتب العقاري في عرض العقار.
•	يجب أن تكون الإعلانات التي ينشرها الوكيل صحيحة وموثوقة، وتعكس الوضع الحقيقي للعقار المعروض. لا يجوز تضليل العملاء أو التلاعب بالمعلومات.
•	يتعين على الوكيل الالتزام بأعلى معايير المهنية والأخلاقيات في التعامل مع العملاء وتقديم الخدمات نيابةً عن موكله.
•	يتعين علي الموقع تحميل كلا منهما المسؤولية الكاملة في حال عمل كلا منهما علي تضليل وتزوير او المبالغة في بيانات الاعلانات
•	يجب عليك التوضيح التام في بيانات الإعلان  وارافاق صور واضحة
•	يحق للموقع حذف  أي إعلانات تتضمن محتوي غير أخلاقي او اعلان تم تكراره من اكثر من جهة
   اذا كنت مشتريًا أو مستأجرًا:
   •	يجب أن تكون الطلبات المقدمة من المشترين أو المستأجرين من خلال الموقع مبنية على نية حقيقية للشراء أو الاستئجار، ويجب تقديم معلومات دقيقة حول احتياجاتهم.
•	يُمنع استخدام الإعلانات بشكل غير جاد أو لمحاولة التلاعب بالمزودين أو الملاك. يجب أن يكون التواصل مع المزودين بناءً على رغبة حقيقية في الشراء أو الاستئجار.
•	يجب على المشترين والمستأجرين الالتزام بجميع الإجراءات القانونية والعقود المتعلقة بالعقارات التي يتم التعامل معها من خلال الموقع، بما في ذلك الالتزامات المالية والتعاقدية.
•	يجب عليك تفحص جميع البيانات الخاصة بالإعلان وعلم ان الموقع لا يضمن الضمان الكامل ان البيانات موثقة ولا يتحمل المسؤولية.



                ',
            ],
            [
                'header' => 'انتفاء دليلك عن الإعلانات:',
                'content' => '

تقر وتوافق على أن دليلك غير ملزم بمراقبة الإعلانات أو محتواها أو الموافقة عليها أو تنظيمها. لا نتحمل مسؤولية الإعلانات المنشورة على المنصة.
إن كنت ترغب في استئجار أو شراء عقار عن طريق الموقع، فعليك التعاقد مع المستخدم الذي نشر الإعلان ذي الصلة بدون تدخل من دليلك.
على الرغم من عدم تحمل دليلك  المسؤولية عن الإعلانات، نحتفظ بحق مراقبة الإعلانات وإزالة أي إعلان من الموقع إن رأينا حسب تقديرنا المطلق أنه ينتهك شروط الاستخدام هذه.


                ',
            ],
            [
                'header' => 'مخالفة شروط الاستخدام:',
                'content' => '

                إن رأينا حسب تقديرنا المطلق أنك في مخالفة لشروط الاستخدام هذه، فيجوز لنا اتخاذ الإجراء الذي نراه ملائمًا حسب تقديرنا وحدنا، بما يشمل على سبيل المثال لا الحصر، تعليق حقك في استخدام الموقع  أو محتواها أو إسقاط ذلك الحق، أو إغلاق حسابك، أو اتخاذ إجراء قانوني ضدك أو كل ما سبق.

                ',
            ],

            [
                'header' => 'سياسة الخصوصية',
                'content' => 'نحن نقدر خصوصيتك وملتزمون بحماية بياناتك الشخصية. يرجى قراءة سياسة الخصوصية لدينا لفهم كيفية جمع واستخدام وحماية معلوماتك.'
            ]
        ]);
    }
}
