<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class HelpsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('helps')->insert([
            [
                'title' => 'كيفية تسجيل الدخول',
                'content' => 'لتسجيل الدخول إلى حسابك، انتقل إلى صفحة تسجيل الدخول وأدخل بريدك الإلكتروني وكلمة المرور. اضغط على زر تسجيل الدخول للوصول إلى حسابك.',
                'type' => 'الأسئلة الشائعة',
            ],
            [
                'title' => 'كيفية إضافة عقار',
                'content' => 'لإضافة عقار، انتقل إلى قسم إضافة عقار في لوحة التحكم الخاصة بك. قم بملء تفاصيل العقار مثل العنوان، السعر، والوصف، ثم اضغط على زر حفظ.',
                'type' => 'الأسئلة الشائعة',
            ],
            [
                'title' => 'كيفية تعديل معلومات العقار',
                'content' => 'لتعديل معلومات عقار موجود، انتقل إلى قسم إدارة العقارات وابحث عن العقار الذي ترغب في تعديله. قم بتعديل التفاصيل المطلوبة واضغط على زر حفظ التعديلات.',
                'type' => 'الأسئلة الشائعة',
            ],
            [
                'title' => 'كيفية حذف عقار',
                'content' => 'لحذف عقار، انتقل إلى قسم إدارة العقارات وابحث عن العقار الذي ترغب في حذفه. اضغط على زر الحذف بجانب العقار وأكد عملية الحذف.',
                'type' => 'الأسئلة الشائعة',
            ],
            [
                'title' => 'كيفية التواصل مع الدعم الفني',
                'content' => 'للتواصل مع الدعم الفني، انتقل إلى صفحة "اتصل بنا" على الموقع. يمكنك ملء نموذج الاتصال أو استخدام تفاصيل الاتصال المقدمة للتواصل مباشرة مع فريق الدعم.',
                'type' => 'الأسئلة الشائعة',
            ],
        ]);
    }
}
